scripts/ssd-prefetch-ttft-ab/evidence/final-round/0327ddcb-a2-142-r2/results/b_overflow.bench.log
INFO 09-22 02:21:42 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-22 02:21:42 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 09-22 02:21:42 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 09-22 02:21:42 [__init__.py:238] Platform plugin ascend is activated
INFO 09-22 02:21:42 [platform.py:62] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
2026-09-22 02:21:52,946 - 74550 - ServiceProfiler - INFO - VLLM_USE_V1 not set, auto-detected via vLLM 0.23.0+empty: default 1
INFO 09-22 02:21:53 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.netloader.netloader.ModelNetLoaderElastic'>` with load format `netloader`
INFO 09-22 02:21:53 [__init__.py:115] Registered model loader `<class 'vllm_ascend.model_loader.rfork.rfork_loader.RForkModelLoader'>` with load format `rfork`
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffef8c7eca0>, trust_remote_code=True, seed=1042, num_prompts=48, dataset_name='custom', no_stream=False, dataset_path='/home/<user>/prefetch_916/920_pre_pr/perf/data/overflow.jsonl', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=8, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8271', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='dsv4-flash', input_len=None, output_len=None, tokenizer='/home/<user>/DeepSeek-V4-Flash-w8a8-mtp/DeepSeek-V4-Flash-w8a8-mtp', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/home/<user>/prefetch_916/920_pre_pr/ttft-ab/results', result_filename='b_overflow.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-52487e25-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
`rope_parameters`'s factor field must be a float >= 1, got 16
`rope_parameters`'s beta_fast field must be a float, got 32
`rope_parameters`'s beta_slow field must be a float, got 1
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/48 [00:00<?, ?it/s]
  2%|▏         | 1/48 [00:04<03:46,  4.81s/it]
  4%|▍         | 2/48 [00:09<03:40,  4.78s/it]
  6%|▋         | 3/48 [00:14<03:34,  4.76s/it]
  8%|▊         | 4/48 [00:19<03:30,  4.79s/it]
 10%|█         | 5/48 [00:23<03:25,  4.79s/it]
 12%|█▎        | 6/48 [00:28<03:22,  4.81s/it]
 15%|█▍        | 7/48 [00:33<03:17,  4.82s/it]
 17%|█▋        | 8/48 [00:38<03:13,  4.83s/it]
 19%|█▉        | 9/48 [00:40<02:38,  4.05s/it]
 21%|██        | 10/48 [00:45<02:46,  4.38s/it]
 23%|██▎       | 11/48 [00:50<02:46,  4.51s/it]
 25%|██▌       | 12/48 [00:55<02:45,  4.60s/it]
 27%|██▋       | 13/48 [00:57<02:16,  3.91s/it]
 29%|██▉       | 14/48 [01:02<02:24,  4.25s/it]
 31%|███▏      | 15/48 [01:07<02:25,  4.42s/it]
 33%|███▎      | 16/48 [01:12<02:24,  4.53s/it]
 35%|███▌      | 17/48 [01:17<02:22,  4.61s/it]
 38%|███▊      | 18/48 [01:22<02:19,  4.66s/it]
 40%|███▉      | 19/48 [01:26<02:16,  4.71s/it]
 42%|████▏     | 20/48 [01:31<02:12,  4.73s/it]
 44%|████▍     | 21/48 [01:36<02:08,  4.75s/it]
 46%|████▌     | 22/48 [01:41<02:03,  4.76s/it]
 48%|████▊     | 23/48 [01:46<01:59,  4.77s/it]
 50%|█████     | 24/48 [01:50<01:54,  4.77s/it]
 52%|█████▏    | 25/48 [01:55<01:49,  4.77s/it]
 54%|█████▍    | 26/48 [02:00<01:44,  4.77s/it]
 56%|█████▋    | 27/48 [02:05<01:40,  4.77s/it]
 58%|█████▊    | 28/48 [02:07<01:20,  4.03s/it]
 60%|██████    | 29/48 [02:12<01:22,  4.32s/it]
 62%|██████▎   | 30/48 [02:17<01:20,  4.46s/it]
 65%|██████▍   | 31/48 [02:22<01:17,  4.57s/it]
 67%|██████▋   | 32/48 [02:26<01:14,  4.63s/it]
 69%|██████▉   | 33/48 [02:31<01:09,  4.66s/it]
 71%|███████   | 34/48 [02:36<01:05,  4.70s/it]
 73%|███████▎  | 35/48 [02:41<01:01,  4.71s/it]
 75%|███████▌  | 36/48 [02:45<00:56,  4.71s/it]
 77%|███████▋  | 37/48 [02:48<00:43,  3.98s/it]
 79%|███████▉  | 38/48 [02:50<00:35,  3.55s/it]
 81%|████████▏ | 39/48 [02:55<00:35,  4.00s/it]
 83%|████████▎ | 40/48 [03:00<00:33,  4.22s/it]
 85%|████████▌ | 41/48 [03:05<00:30,  4.37s/it]
 88%|████████▊ | 42/48 [03:09<00:26,  4.49s/it]
 90%|████████▉ | 43/48 [03:14<00:22,  4.56s/it]
 92%|█████████▏| 44/48 [03:19<00:18,  4.61s/it]
 94%|█████████▍| 45/48 [03:24<00:13,  4.64s/it]
 96%|█████████▌| 46/48 [03:28<00:09,  4.67s/it]
 98%|█████████▊| 47/48 [03:33<00:04,  4.68s/it]
100%|██████████| 48/48 [03:38<00:00,  4.70s/it]
100%|██████████| 48/48 [03:38<00:00,  4.55s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     48        
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  218.23    
Total input tokens:                      786929    
Total generated tokens:                  349       
Request throughput (req/s):              0.22      
Output token throughput (tok/s):         1.60      
Peak output token throughput (tok/s):    3.00      
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          3607.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          2351.18   
Median TTFT (ms):                        2330.53   
P50 TTFT (ms):                           2330.53   
P90 TTFT (ms):                           2440.59   
P99 TTFT (ms):                           2636.61   
==================================================